tap "roccojiang/tap"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Diff that understands syntax
brew "difftastic"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility that provides fast incremental file transfer
brew "rsync"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
